app/Controllers/Peminjaman.php

  public function detail($id)
  {
    $detailPeminjaman = $this->DetailPeminjamanModel->where('peminjaman_id', $id)
      ->join('tb_buku', 'tb_buku.id = tb_detail_peminjaman.buku_id')
      ->findAll();

    $id_admin = session()->get('id');
    $data = [
      'title' => 'CRUD Peminjaman',
      'peminjaman_id' => $id,
      'detail_peminjaman' => $detailPeminjaman,
      'admin' => $this->ProfilAdmin->Profil($id_admin),
      'buku' => $this->bukuModel->Alldata(),
      'peminjam' => $this->PeminjamanModel->find($id),
---
SELECT *
FROM `tb_detail_peminjaman`
JOIN `tb_buku` ON `tb_buku`.`id` = `tb_detail_peminjaman`.`buku_id`
WHERE `peminjaman_id` = '7'
SELECT *
FROM `tb_peminjaman`
WHERE `tb_peminjaman`.`id` = '7'