app/Models/AnggotaModel.php

    public function Alldata()
   {
     return $this->db->table('tb_user')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();
---
SELECT *
FROM `tb_user`
ORDER BY `id` DESC