app/Models/bukuModel.php

SELECT *
FROM `tb_buku`
ORDER BY `id` DESC
---
    public function Alldata()
   {
     return $this->db->table('tb_buku')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();