app/Models/DetailModel.php

   public function Alldata()
   {
     return $this->db->table('tb_detail_peminjaman')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();
---
SELECT *
FROM `tb_detail_peminjaman`
ORDER BY `id` DESC