app/Models/KategoriModel.php

SELECT *
FROM `tb_kategori`
ORDER BY `id` DESC
---
   public function Alldata()
   {
     return $this->db->table('tb_kategori')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();