app/Models/loginuser.php

    public function loginUser($email, $password)
    {
      return $this->db->table('tb_user')
      ->where([
        'email' => $email,
        'password' => $password,
      ])->get()->getRowArray();
---
SELECT *
FROM `tb_user`
WHERE `email` = 'salmaumayna@gmail.com'
AND `password` = '12345'