app/Models/PeminjamanModel.php

   public function Alldata()
   {
     return $this->db->table('tb_peminjaman')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();
---
SELECT *
FROM `tb_peminjaman`
ORDER BY `id` DESC