app/Models/PenerbitModel.php

    public function Alldata()
   {
     return $this->db->table('tb_penerbit')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();
---
SELECT *
FROM `tb_penerbit`
ORDER BY `id` DESC