app/Models/PenulisModel.php

SELECT *
FROM `tb_penulis`
ORDER BY `id` DESC
---
    public function Alldata()
   {
     return $this->db->table('tb_penulis')
     ->orderBy('id', 'DESC')
     ->get()->getResultArray();