app/Models/ProfilAdmin.php

SELECT *
FROM `tb_user`
WHERE `id` = '11'
---
    public function Profil($id_admin)
    {
        return $this->db->table('tb_user')
        ->where('id', $id_admin)
        ->get()->getRowArray();